<?php
//създават двавложени цикъла for
for($i=1; $i<6; $i++)
{
    for($j=0;$j<=$i;$j++)
    {//провярява се далиj<i , за да структурира триъгълника
        if($j<$i)
        {
            echo '*';
            
    }
    else 
    {
        
        echo '<br/>';
    }
    
}
//правя същите вложени цикъла, но на обратно, 
}
 for($k=6; $k>0; $k--)
{
    for($l=5;$l>0;$l--)
    {
        if($l<$k)
        {
            echo '*';
            
    }
   // else 
    //{
        
        //echo '<br/>';
    //}
    
}
echo '<br/>';
}

