<?php
//инициализирам си променлива, която е равна на 1, нА която ще е равен първия
//елемент на триъгълника и след всяка изпълнение на цикъла на нея ще се добавя 
// по единица

$triangle5=1;
//създавам два вложени цикъла, които подобно на задачата със звездите да направят
//решетка, правеща проверка за числата в триъгълника
for($i=1;$i<6;$i++)
{
    for($j=0; $j<=$i; $j++)
    {
        //правя проверка дали J  е по-малко от I, за да  може да се структурира триъгълник
        if($j<$i)
        {
            //извеждам всяка от стойностите като след всяка от тях поставям интервал
            echo $triangle5 . ' ';
            // след всяко изпълнения на цикъла добавям по единица
            $triangle5++;
            
        }
        else
        {
            echo '<br/>';
        }
                
      
    }
}
echo '<br/>';
// правя същото и за останалите два триъгълника на Флойд.
$triangle10=1;

for($i=1;$i<11;$i++)
{
    for($j=0; $j<=$i; $j++)
    {
        if($j<$i)
        {
            echo $triangle10 . ' ';
            $triangle10++;
            
        }
        else
        {
            echo '<br/>';
        }
                
      
    }
}
 echo '<br/>';
 
 $triangle21=1;

for($i=1;$i<22;$i++)
{
    for($j=0; $j<=$i; $j++)
    {
        if($j<$i)
        {
            echo $triangle21 . ' ';
            $triangle21++;
            
        }
        else
        {
            echo '<br/>';
        }
                
      
    }
}
